{
  "_name_or_path": "google/mobilenet_v2_1.0_224",
  "architectures": [
    "MobileNetV2ForImageClassification"
  ],
  "classifier_dropout_prob": 0.8,
  "depth_divisible_by": 8,
  "depth_multiplier": 1.0,
  "expand_ratio": 6,
  "finegrained_output": true,
  "first_layer_is_expansion": true,
  "hidden_act": "relu6",
  "id2label": {
    "0": "Apple Scab",
    "1": "Apple with Black Rot",
    "2": "Cedar Apple Rust",
    "3": "Healthy Apple",
    "4": "Healthy Blueberry Plant",
    "5": "Cherry with Powdery Mildew",
    "6": "Healthy Cherry Plant",
    "7": "Corn (Maize) with Cercospora and Gray Leaf Spot",
    "8": "Corn (Maize) with Common Rust",
    "9": "Corn (Maize) with Northern Leaf Blight",
    "10": "Healthy Corn (Maize) Plant",
    "11": "Grape with Black Rot",
    "12": "Grape with Esca (Black Measles)",
    "13": "Grape with Isariopsis Leaf Spot",
    "14": "Healthy Grape Plant",
    "15": "Orange with Citrus Greening",
    "16": "Peach with Bacterial Spot",
    "17": "Healthy Peach Plant",
    "18": "Bell Pepper with Bacterial Spot",
    "19": "Healthy Bell Pepper Plant",
    "20": "Potato with Early Blight",
    "21": "Potato with Late Blight",
    "22": "Healthy Potato Plant",
    "23": "Healthy Raspberry Plant",
    "24": "Healthy Soybean Plant",
    "25": "Squash with Powdery Mildew",
    "26": "Strawberry with Leaf Scorch",
    "27": "Healthy Strawberry Plant",
    "28": "Tomato with Bacterial Spot",
    "29": "Tomato with Early Blight",
    "30": "Tomato with Late Blight",
    "31": "Tomato with Leaf Mold",
    "32": "Tomato with Septoria Leaf Spot",
    "33": "Tomato with Spider Mites or Two-spotted Spider Mite",
    "34": "Tomato with Target Spot",
    "35": "Tomato Yellow Leaf Curl Virus",
    "36": "Tomato Mosaic Virus",
    "37": "Healthy Tomato Plant"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "Apple Scab": 0,
    "Apple with Black Rot": 1,
    "Cedar Apple Rust": 2,
    "Healthy Apple": 3,
    "Healthy Blueberry Plant": 4,
    "Cherry with Powdery Mildew": 5,
    "Healthy Cherry Plant": 6,
    "Corn (Maize) with Cercospora and Gray Leaf Spot": 7,
    "Corn (Maize) with Common Rust": 8,
    "Corn (Maize) with Northern Leaf Blight": 9,
    "Healthy Corn (Maize) Plant": 10,
    "Grape with Black Rot": 11,
    "Grape with Esca (Black Measles)": 12,
    "Grape with Isariopsis Leaf Spot": 13,
    "Healthy Grape Plant": 14,
    "Orange with Citrus Greening": 15,
    "Peach with Bacterial Spot": 16,
    "Healthy Peach Plant": 17,
    "Bell Pepper with Bacterial Spot": 18,
    "Healthy Bell Pepper Plant": 19,
    "Potato with Early Blight": 20,
    "Potato with Late Blight": 21,
    "Healthy Potato Plant": 22,
    "Healthy Raspberry Plant": 23,
    "Healthy Soybean Plant": 24,
    "Squash with Powdery Mildew": 25,
    "Strawberry with Leaf Scorch": 26,
    "Healthy Strawberry Plant": 27,
    "Tomato with Bacterial Spot": 28,
    "Tomato with Early Blight": 29,
    "Tomato with Late Blight": 30,
    "Tomato with Leaf Mold": 31,
    "Tomato with Septoria Leaf Spot": 32,
    "Tomato with Spider Mites or Two-spotted Spider Mite": 33,
    "Tomato with Target Spot": 34,
    "Tomato Yellow Leaf Curl Virus": 35,
    "Tomato Mosaic Virus": 36,
    "Healthy Tomato Plant": 37
  },
  "layer_norm_eps": 0.001,
  "min_depth": 8,
  "model_type": "mobilenet_v2",
  "num_channels": 3,
  "output_stride": 32,
  "problem_type": "single_label_classification",
  "semantic_loss_ignore_index": 255,
  "tf_padding": true,
  "torch_dtype": "float32",
  "transformers_version": "4.27.3"
}
